---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurveFailures.LineTooShortWarning
source: html/82171d2d-96cf-901b-e71c-b67cdaa4587b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurveFailures.LineTooShortWarning Property

Line is too short.

## Syntax (C#)
```csharp
public static FailureDefinitionId LineTooShortWarning { get; }
```